         CLIPS (Quicksilver Beta 3/26/08)
CLIPS> (clear)
CLIPS> (load classes.clp)
Defining defclass: %3ACLIPS_TOP_LEVEL_SLOT_CLASS
Defining defclass: Person
Defining defclass: Exercise
Defining defclass: WithoutWeights
Defining defclass: Bike
Defining defclass: Run
Defining defclass: Floor
Defining defclass: WithWeights
Defining defclass: Habit
Defining defclass: InWork
Defining defclass: OutWork
Defining defclass: Movement
Defining defclass: TestPerson
Defining defclass: BasicPhysicalCondition
TRUE
CLIPS> (load instances.clp)
Defining definstances: Persons
Defining definstances: BasicPhysicalCondition
Defining definstances: TestPerson
Defining definstances: Exercises
Defining definstances: Habits
TRUE
CLIPS> (load facts_templates.CLP)
Defining deftemplate: personalData
Defining deffacts: persDat
Defining deftemplate: habitsPerson
Defining deffacts: habs
Defining deftemplate: basicPhyCond
Defining deffacts: bpc
Defining deftemplate: difficultyIntensity
Defining deffacts: dif_intens
Defining deftemplate: basicPhysicalCond
Defining deffacts: basicPC
Defining deftemplate: testPerson
Defining deffacts: testPers
Defining deftemplate: exercisesPerson
Defining deffacts: exsPerson
TRUE
CLIPS> (load messages.clp)
Defining defmessage-handler: Person
   Handler print primary defined.
TRUE
CLIPS> (load functions.clp)
Defining defglobal: user
Defining defglobal: opc
Defining defglobal: musc
Defining deffunction: set-value
Defining deffunction: set-number
Defining deffunction: set-single-from-list
Defining deffunction: set-multi-from-list
Defining deffunction: set-unique-list
Defining deffunction: set-difficulty
Defining deffunction: set-pulsations
Defining deffunction: calculate-totalTime
Defining deffunction: enoughTime
Defining deffunction: show-program
Defining deffunction: get-ex-musc
Defining deffunction: get-ex-cal
Defining deffunction: generate-schedule
TRUE
CLIPS> (load rules_modules.clp)

[CSTRCPSR1] WARNING: Redefining defmodule: MAIN
Defining defrule: start +j+j
Defining defmodule: createPerson-module
Defining defrule: create-person +j+j
Defining defmodule: habits-module
Defining defrule: set-habits +j+j
Defining defmodule: existingPerson-module
Defining defrule: existing-person =j+j+j+j+j
Defining defmodule: difficulty_intensity-module
Defining defrule: difficulty-intensity +j
Defining defmodule: bpc-module
Defining defrule: set-bpc +j+j+j
Defining defmodule: test-module
Defining defrule: set-test +j+j+j
Defining defmodule: exercises-module
Defining defrule: set-exercises +j+j+j
TRUE
CLIPS> (reset)
CLIPS> (run)

+-------------------------------------------+
|                                           |
|         WELCOME TO OUR FITNESS GYM        |
|                                           |
+-------------------------------------------+
Select an option:
1. Create a new person
2. Select an existing person
3. Exit
2
Seleccionando existente
1. - Alex
2. - Anna
3. - Javi
4. - Juan
5. - Kevin
6. - Lucas
7. - Maite
8. - Marc
9. - Pepe
10. - Victor
5


------------------------Person Basic Information-------------------------

    Name: Kevin
    LastName: 
    age: 30 years 
    goal: (reduce_weight rehabilitate)
    Initial difficulty or intensity supported 
    (calculated by habits): easy

------------------------------Person Habits------------------------------

    No habits selected 

--------------------Person Basic Physical Information--------------------

    height: 180 cm 
    weight: 102 kg 
    index of body mass: 31.4814814814815
    blood maximum pressure: 139 sistolic 
    blood minimum pressure: 89 diastolic 
    diet: (excess_greases excess_sal snacking lack_vitamines)
    muscular problems: (limited_mobility)

-----------------------Results Test Basic Exercises----------------------

    exercises done: ([bike_easy] [run_easy])
    pulsations per minute: 146
        Your pulsations per min are normal
    muscular tension: quite
    tiredness sensation: huge
    dizziness: high

-------------------------------------------------------------------------



Difficulty_intensity modified to 'easy' because of results of the test done
Re-showing person info...


------------------------Person Basic Information-------------------------

    Name: Kevin
    LastName: 
    age: 30 years 
    goal: (reduce_weight rehabilitate)
    Initial difficulty or intensity supported 
    (calculated by habits): easy

------------------------------Person Habits------------------------------

    No habits selected 

--------------------Person Basic Physical Information--------------------

    height: 180 cm 
    weight: 102 kg 
    index of body mass: 31.4814814814815
    blood maximum pressure: 139 sistolic 
    blood minimum pressure: 89 diastolic 
    diet: (excess_greases excess_sal snacking lack_vitamines)
    muscular problems: (limited_mobility)

-----------------------Results Test Basic Exercises----------------------

    exercises done: ([bike_easy] [run_easy])
    pulsations per minute: 146
        Your pulsations per min are normal
    muscular tension: quite
    tiredness sensation: huge
    dizziness: high

-------------------------------------------------------------------------


List of exercises filtered to assign to the schedule: 
	Triceps Easy
	Quadriceps Easy
	Pectorals Easy
	Biceps Easy
	Back Easy
	Stretching Easy
	Dominates Easy
	Abdominals Easy
	Run Easy
	Bike Easy 10 Minutes

How many minutes per day can you dedicate (in minutes) (between 30 and 960)?
60

-------------------monday-------------------
	EXERCISE: Run Easy
	EXERCISE: Run Easy
	EXERCISE: Run Easy
	EXERCISE: Stretching Easy
	EXERCISE: Run Easy
	EXERCISE: Run Easy
	EXERCISE: Stretching Easy

-------------------tuesday-------------------
	EXERCISE: Run Easy
	EXERCISE: Bike Easy 10 Minutes
	EXERCISE: Abdominals Easy
	EXERCISE: Triceps Easy

-------------------wednesday-------------------
	EXERCISE: Back Easy
	EXERCISE: Quadriceps Easy
	EXERCISE: Back Easy
	EXERCISE: Pectorals Easy
	EXERCISE: Run Easy
	EXERCISE: Pectorals Easy

-------------------thursday-------------------
	EXERCISE: Run Easy
	EXERCISE: Bike Easy 10 Minutes
	EXERCISE: Abdominals Easy
	EXERCISE: Triceps Easy

-------------------friday-------------------
	EXERCISE: Back Easy
	EXERCISE: Pectorals Easy
	EXERCISE: Quadriceps Easy
	EXERCISE: Quadriceps Easy
	EXERCISE: Pectorals Easy
	EXERCISE: Run Easy
CLIPS> 
