         CLIPS (Quicksilver Beta 3/26/08)
CLIPS> (clear)
CLIPS> (load classes.clp)
Defining defclass: %3ACLIPS_TOP_LEVEL_SLOT_CLASS
Defining defclass: Person
Defining defclass: Exercise
Defining defclass: WithoutWeights
Defining defclass: Bike
Defining defclass: Run
Defining defclass: Floor
Defining defclass: WithWeights
Defining defclass: Habit
Defining defclass: InWork
Defining defclass: OutWork
Defining defclass: Movement
Defining defclass: TestPerson
Defining defclass: BasicPhysicalCondition
TRUE
CLIPS> (load instances.clp)
Defining definstances: Persons
Defining definstances: BasicPhysicalCondition
Defining definstances: TestPerson
Defining definstances: Exercises
Defining definstances: Habits
TRUE
CLIPS> (load facts_templates.CLP)
Defining deftemplate: personalData
Defining deffacts: persDat
Defining deftemplate: habitsPerson
Defining deffacts: habs
Defining deftemplate: basicPhyCond
Defining deffacts: bpc
Defining deftemplate: difficultyIntensity
Defining deffacts: dif_intens
Defining deftemplate: basicPhysicalCond
Defining deffacts: basicPC
Defining deftemplate: testPerson
Defining deffacts: testPers
Defining deftemplate: exercisesPerson
Defining deffacts: exsPerson
TRUE
CLIPS> (load messages.clp)
Defining defmessage-handler: Person
   Handler print primary defined.
TRUE
CLIPS> (load functions.clp)
Defining defglobal: user
Defining defglobal: opc
Defining defglobal: musc
Defining deffunction: set-value
Defining deffunction: set-number
Defining deffunction: set-single-from-list
Defining deffunction: set-multi-from-list
Defining deffunction: set-unique-list
Defining deffunction: set-difficulty
Defining deffunction: set-pulsations
Defining deffunction: calculate-totalTime
Defining deffunction: enoughTime
Defining deffunction: show-program
Defining deffunction: get-ex-musc
Defining deffunction: get-ex-cal
Defining deffunction: generate-schedule
TRUE
CLIPS> (load rules_modules.clp)

[CSTRCPSR1] WARNING: Redefining defmodule: MAIN
Defining defrule: start +j+j
Defining defmodule: createPerson-module
Defining defrule: create-person +j+j
Defining defmodule: habits-module
Defining defrule: set-habits +j+j
Defining defmodule: existingPerson-module
Defining defrule: existing-person =j+j+j+j+j
Defining defmodule: difficulty_intensity-module
Defining defrule: difficulty-intensity +j
Defining defmodule: bpc-module
Defining defrule: set-bpc +j+j+j
Defining defmodule: test-module
Defining defrule: set-test +j+j+j
Defining defmodule: exercises-module
Defining defrule: set-exercises +j+j+j
TRUE
CLIPS> (reset)
CLIPS> (run)

+-------------------------------------------+
|                                           |
|         WELCOME TO OUR FITNESS GYM        |
|                                           |
+-------------------------------------------+
Select an option:
1. Create a new person
2. Select an existing person
3. Exit
1
Creando persona
What is your name?
Robbin
What is your last_name?
Walter
How old are you (between 16-130)?
31
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
flexibility
Do you wish to add another? (yes/no)
yes
(flexibility)
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
balance
Do you wish to add another? (yes/no)
yes
(balance flexibility)
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
rehabilitate
Do you wish to add another? (yes/no)
no
(rehabilitate balance flexibility)


------------------------Person Basic Information-------------------------

    Name: Robbin
    LastName: Walter
    age: 31 years 
    goal: (rehabilitate balance flexibility)

------------------------------Person Habits------------------------------

    No habits selected 

-------------------------------------------------------------------------


-------------------------------------------------------------------------



-------------------------------------------------------------------------


Insert the type of your habit?
(InWork OutWork Movement)?
Movement
    walk
    bike
Insert the name of your habit (if it is shown)?
(none bike walk)?
bike
What is the duration of your habit (between 0-500)?
20
What is the frequency of your habit?
(few medium quite very_high)?
medium
Do you want to add another habit? yes/no
no


------------------------Person Basic Information-------------------------

    Name: Robbin
    LastName: Walter
    age: 31 years 
    goal: (rehabilitate balance flexibility)
    Initial difficulty or intensity supported 
    (calculated by habits): medium

------------------------------Person Habits------------------------------

    Movement: bike 20 min with frequency: 'medium'

-------------------------------------------------------------------------


-------------------------------------------------------------------------



-------------------------------------------------------------------------


How tall are you (in cm) (between 120-240)?
180
How much you weigh (in kg) (between 25-150)?
81
What is your blood maximum presure (between 30-200)?
122
What is your blood minimum presure (between 30-200)?
81
What is/are the feature/s or problem/s of your kind of diet (select from this list)?
(balanced lack_calcium lack_vitamines lack_iron excess_greases excess_sal snacking)?
excess_sal
Do you wish to add another? (yes/no)
no
(excess_sal)
What is/are your muscular problems (select from this list)?
(none back_pain limited_mobility ankle_sprain wrist_sprain neck_pain arm_pain knee_ligaments)?
balanced
You have selected something which is not shown in the list
What is/are your muscular problems (select from this list)?
(none back_pain limited_mobility ankle_sprain wrist_sprain neck_pain arm_pain knee_ligaments)?
knee_ligaments
Do you wish to add another? (yes/no)
yes
(knee_ligaments)
What is/are your muscular problems (select from this list)?
(none back_pain limited_mobility ankle_sprain wrist_sprain neck_pain arm_pain knee_ligaments)?
back_pain
Do you wish to add another? (yes/no)
yes
(back_pain knee_ligaments)
What is/are your muscular problems (select from this list)?
(none back_pain limited_mobility ankle_sprain wrist_sprain neck_pain arm_pain knee_ligaments)?
neck_pain
Do you wish to add another? (yes/no)
no
(neck_pain back_pain knee_ligaments)


------------------------Person Basic Information-------------------------

    Name: Robbin
    LastName: Walter
    age: 31 years 
    goal: (rehabilitate balance flexibility)
    Initial difficulty or intensity supported 
    (calculated by habits): medium

------------------------------Person Habits------------------------------

    Movement: bike 20 min with frequency: 'medium'

--------------------Person Basic Physical Information--------------------

    height: 180 cm 
    weight: 81 kg 
    index of body mass: 25.0
    blood maximum pressure: 122 sistolic 
    blood minimum pressure: 81 diastolic 
    diet: (excess_sal)
    muscular problems: (neck_pain back_pain knee_ligaments)

-------------------------------------------------------------------------



-------------------------------------------------------------------------


please answer the questions of the exercises done: 
([MAIN::run_easy] [MAIN::bike_easy])

What is your muscular tension?
(normal quite high)?
quite
What is your tiredness sensation?
(few normal quite huge)?
normal
Are you dizzy?
(no few quite high)?
few


------------------------Person Basic Information-------------------------

    Name: Robbin
    LastName: Walter
    age: 31 years 
    goal: (rehabilitate balance flexibility)
    Initial difficulty or intensity supported 
    (calculated by habits): medium

------------------------------Person Habits------------------------------

    Movement: bike 20 min with frequency: 'medium'

--------------------Person Basic Physical Information--------------------

    height: 180 cm 
    weight: 81 kg 
    index of body mass: 25.0
    blood maximum pressure: 122 sistolic 
    blood minimum pressure: 81 diastolic 
    diet: (excess_sal)
    muscular problems: (neck_pain back_pain knee_ligaments)

-----------------------Results Test Basic Exercises----------------------

    exercises done: ([MAIN::run_easy] [MAIN::bike_easy])
    pulsations per minute: 119
        Your pulsations per min are normal
    muscular tension: quite
    tiredness sensation: normal
    dizziness: few

-------------------------------------------------------------------------


List of exercises filtered to assign to the schedule: 
	Quadriceps Medium Level 2
	Quadriceps Medium Level 1 (without contraindications)
	Run Medium Level 1 (no Contraindications)
	Triceps Medium Level 1 (without Contraindications)
	Stretching Medium Level 1 (without Contraindications)
	Dominates Medium Level 1 (without Contraindications)
	Bike Medium Level 1 (without Contraindications)

How many minutes per day can you dedicate (in minutes) (between 30 and 960)?
90

-------------------monday-------------------
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Bike Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Quadriceps Medium Level 2

-------------------tuesday-------------------
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Triceps Medium Level 1 (without Contraindications)
	EXERCISE: Bike Medium Level 1 (without Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)
	EXERCISE: Bike Medium Level 1 (without Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)

-------------------wednesday-------------------
	EXERCISE: Bike Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Quadriceps Medium Level 2
	EXERCISE: Dominates Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)

-------------------thursday-------------------
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Triceps Medium Level 1 (without Contraindications)
	EXERCISE: Triceps Medium Level 1 (without Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)

-------------------friday-------------------
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Stretching Medium Level 1 (without Contraindications)
	EXERCISE: Quadriceps Medium Level 2
	EXERCISE: Quadriceps Medium Level 2
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Dominates Medium Level 1 (without Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Run Medium Level 1 (no Contraindications)
	EXERCISE: Quadriceps Medium Level 2
CLIPS> 