         CLIPS (Quicksilver Beta 3/26/08)
CLIPS> (clear)
CLIPS> (load classes.clp)
Defining defclass: %3ACLIPS_TOP_LEVEL_SLOT_CLASS
Defining defclass: Person
Defining defclass: Exercise
Defining defclass: WithoutWeights
Defining defclass: Bike
Defining defclass: Run
Defining defclass: Floor
Defining defclass: WithWeights
Defining defclass: Habit
Defining defclass: InWork
Defining defclass: OutWork
Defining defclass: Movement
Defining defclass: TestPerson
Defining defclass: BasicPhysicalCondition
TRUE
CLIPS> (load instances.clp)
Defining definstances: Persons
Defining definstances: BasicPhysicalCondition
Defining definstances: TestPerson
Defining definstances: Exercises
Defining definstances: Habits
TRUE
CLIPS> (load facts_templates.CLP)
Defining deftemplate: personalData
Defining deffacts: persDat
Defining deftemplate: habitsPerson
Defining deffacts: habs
Defining deftemplate: basicPhyCond
Defining deffacts: bpc
Defining deftemplate: difficultyIntensity
Defining deffacts: dif_intens
Defining deftemplate: basicPhysicalCond
Defining deffacts: basicPC
Defining deftemplate: testPerson
Defining deffacts: testPers
Defining deftemplate: exercisesPerson
Defining deffacts: exsPerson
TRUE
CLIPS> (load messages.clp)
Defining defmessage-handler: Person
   Handler print primary defined.
TRUE
CLIPS> (load functions.clp)
Defining defglobal: user
Defining defglobal: opc
Defining defglobal: musc
Defining deffunction: set-value
Defining deffunction: set-number
Defining deffunction: set-single-from-list
Defining deffunction: set-multi-from-list
Defining deffunction: set-unique-list
Defining deffunction: set-difficulty
Defining deffunction: set-pulsations
Defining deffunction: calculate-totalTime
Defining deffunction: enoughTime
Defining deffunction: show-program
Defining deffunction: get-ex-musc
Defining deffunction: get-ex-cal
Defining deffunction: generate-schedule
TRUE
CLIPS> (load rules_modules.clp)

[CSTRCPSR1] WARNING: Redefining defmodule: MAIN
Defining defrule: start +j+j
Defining defmodule: createPerson-module
Defining defrule: create-person +j+j
Defining defmodule: habits-module
Defining defrule: set-habits +j+j
Defining defmodule: existingPerson-module
Defining defrule: existing-person =j+j+j+j+j
Defining defmodule: difficulty_intensity-module
Defining defrule: difficulty-intensity +j
Defining defmodule: bpc-module
Defining defrule: set-bpc +j+j+j
Defining defmodule: test-module
Defining defrule: set-test +j+j+j
Defining defmodule: exercises-module
Defining defrule: set-exercises +j+j+j
TRUE
CLIPS> (reset)
CLIPS> (run)

+-------------------------------------------+
|                                           |
|         WELCOME TO OUR FITNESS GYM        |
|                                           |
+-------------------------------------------+
Select an option:
1. Create a new person
2. Select an existing person
3. Exit
1
Creando persona
What is your name?
Alex
What is your last_name?
White
How old are you (between 16-130)?
28
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
musculation
Do you wish to add another? (yes/no)
yes
(musculation)
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
get_fit
Do you wish to add another? (yes/no)
yes
(get_fit musculation)
What is/are your goal/s in the gym (select one firstly)?
(maintenance get_fit reduce_weight musculation flexibility balance rehabilitate)?
maintenance
Do you wish to add another? (yes/no)
no
(maintenance get_fit musculation)


------------------------Person Basic Information-------------------------

    Name: Alex
    LastName: White
    age: 28 years 
    goal: (maintenance get_fit musculation)

------------------------------Person Habits------------------------------

    No habits selected 

-------------------------------------------------------------------------


-------------------------------------------------------------------------



-------------------------------------------------------------------------


Insert the type of your habit?
(InWork OutWork Movement)?
Movement
    walk
    bike
Insert the name of your habit (if it is shown)?
(none bike walk)?
bike
What is the duration of your habit (between 0-500)?
20
What is the frequency of your habit?
(few medium quite very_high)?
quite
Do you want to add another habit? yes/no
yes
Insert the type of your habit?
(InWork OutWork Movement)?
Movement
    walk
    bike
Insert the name of your habit (if it is shown)?
(none bike walk)?
walk
What is the duration of your habit (between 0-500)?
20
What is the frequency of your habit?
(few medium quite very_high)?
medium
Do you want to add another habit? yes/no
no


------------------------Person Basic Information-------------------------

    Name: Alex
    LastName: White
    age: 28 years 
    goal: (maintenance get_fit musculation)
    Initial difficulty or intensity supported 
    (calculated by habits): hard

------------------------------Person Habits------------------------------

    Movement: walk 20 min with frequency: 'medium'
    Movement: bike 20 min with frequency: 'quite'

-------------------------------------------------------------------------


-------------------------------------------------------------------------



-------------------------------------------------------------------------


How tall are you (in cm) (between 120-240)?
190
How much you weigh (in kg) (between 25-150)?
88
What is your blood maximum presure (between 30-200)?
120
What is your blood minimum presure (between 30-200)?
79
What is/are the feature/s or problem/s of your kind of diet (select from this list)?
(balanced lack_calcium lack_vitamines lack_iron excess_greases excess_sal snacking)?
balanced
(balanced)
What is/are your muscular problems (select from this list)?
(none back_pain limited_mobility ankle_sprain wrist_sprain neck_pain arm_pain knee_ligaments)?
none
(none)


------------------------Person Basic Information-------------------------

    Name: Alex
    LastName: White
    age: 28 years 
    goal: (maintenance get_fit musculation)
    Initial difficulty or intensity supported 
    (calculated by habits): hard

------------------------------Person Habits------------------------------

    Movement: walk 20 min with frequency: 'medium'
    Movement: bike 20 min with frequency: 'quite'

--------------------Person Basic Physical Information--------------------

    height: 190 cm 
    weight: 88 kg 
    index of body mass: 24.3767313019391
    blood maximum pressure: 120 sistolic 
    blood minimum pressure: 79 diastolic 
    diet: (balanced)
    muscular problems: (none)

-------------------------------------------------------------------------



-------------------------------------------------------------------------


please answer the questions of the exercises done: 
([MAIN::run_easy] [MAIN::bike_easy])

What is your muscular tension?
(normal quite high)?
normal
What is your tiredness sensation?
(few normal quite huge)?
few
Are you dizzy?
(no few quite high)?
no


------------------------Person Basic Information-------------------------

    Name: Alex
    LastName: White
    age: 28 years 
    goal: (maintenance get_fit musculation)
    Initial difficulty or intensity supported 
    (calculated by habits): hard

------------------------------Person Habits------------------------------

    Movement: walk 20 min with frequency: 'medium'
    Movement: bike 20 min with frequency: 'quite'

--------------------Person Basic Physical Information--------------------

    height: 190 cm 
    weight: 88 kg 
    index of body mass: 24.3767313019391
    blood maximum pressure: 120 sistolic 
    blood minimum pressure: 79 diastolic 
    diet: (balanced)
    muscular problems: (none)

-----------------------Results Test Basic Exercises----------------------

    exercises done: ([MAIN::run_easy] [MAIN::bike_easy])
    pulsations per minute: 112
        Your pulsations per min are normal
    muscular tension: normal
    tiredness sensation: few
    dizziness: no

-------------------------------------------------------------------------


List of exercises filtered to assign to the schedule: 
	Quadriceps Hard Level 2
	Quadriceps Hard Level 1 (without contraindications)
	Pectoralis Hard Level 2
	Pectoralis Hard Level 1 (without contraindications)
	Biceps Hard Level 2
	Biceps Hard Level 1 (without contraindications)
	Back Hard Level 2
	Back Hard Level 1 (without contraindications)
	Triceps Hard Level 2
	Triceps Hard Level 1 (without Contraindications)
	Stretching Hard Level 2
	Stretching Hard Level 1 (without Contraindications)
	Dominates Hard Level 2
	Dominates Hard Level 1 (without Contraindications)
	Abdominals Hard Level 2
	Abdominals Hard Level 1 (without Contraindications)
	Run Hard Level 2
	Run Hard Level 1 (no Contraindications)
	Bike Hard Level 2
	Bike Hard Level 1 (without Contraindications)

How many minutes per day can you dedicate (in minutes) (between 30 and 960)?
150

-------------------monday-------------------
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Run Hard Level 2
	EXERCISE: Pectoralis Hard Level 2
	EXERCISE: Run Hard Level 2
	EXERCISE: Pectoralis Hard Level 1 (without contraindications)
	EXERCISE: Biceps Hard Level 2
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Back Hard Level 2

-------------------tuesday-------------------
	EXERCISE: Biceps Hard Level 2
	EXERCISE: Pectoralis Hard Level 2
	EXERCISE: Dominates Hard Level 1 (without Contraindications)
	EXERCISE: Dominates Hard Level 2
	EXERCISE: Pectoralis Hard Level 2
	EXERCISE: Quadriceps Hard Level 1 (without contraindications)
	EXERCISE: Run Hard Level 2
	EXERCISE: Bike Hard Level 2
	EXERCISE: Abdominals Hard Level 1 (without Contraindications)
	EXERCISE: Back Hard Level 1 (without contraindications)
	EXERCISE: Back Hard Level 2

-------------------wednesday-------------------
	EXERCISE: Dominates Hard Level 1 (without Contraindications)
	EXERCISE: Biceps Hard Level 1 (without contraindications)
	EXERCISE: Back Hard Level 1 (without contraindications)
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Dominates Hard Level 2
	EXERCISE: Biceps Hard Level 2
	EXERCISE: Biceps Hard Level 1 (without contraindications)
	EXERCISE: Back Hard Level 2
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Back Hard Level 2
	EXERCISE: Back Hard Level 2
	EXERCISE: Biceps Hard Level 1 (without contraindications)
	EXERCISE: Dominates Hard Level 2

-------------------thursday-------------------
	EXERCISE: Dominates Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Back Hard Level 1 (without contraindications)
	EXERCISE: Biceps Hard Level 2
	EXERCISE: Pectoralis Hard Level 2
	EXERCISE: Run Hard Level 1 (no Contraindications)
	EXERCISE: Run Hard Level 1 (no Contraindications)
	EXERCISE: Bike Hard Level 1 (without Contraindications)
	EXERCISE: Pectoralis Hard Level 1 (without contraindications)
	EXERCISE: Quadriceps Hard Level 1 (without contraindications)

-------------------friday-------------------
	EXERCISE: Quadriceps Hard Level 1 (without contraindications)
	EXERCISE: Run Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Pectoralis Hard Level 2
	EXERCISE: Dominates Hard Level 1 (without Contraindications)
	EXERCISE: Run Hard Level 2
	EXERCISE: Dominates Hard Level 1 (without Contraindications)
	EXERCISE: Back Hard Level 1 (without contraindications)
	EXERCISE: Back Hard Level 1 (without contraindications)
CLIPS> 