         CLIPS (Quicksilver Beta 3/26/08)
CLIPS> (clear)
CLIPS> (load classes.clp)
Defining defclass: %3ACLIPS_TOP_LEVEL_SLOT_CLASS
Defining defclass: Person
Defining defclass: Exercise
Defining defclass: WithoutWeights
Defining defclass: Bike
Defining defclass: Run
Defining defclass: Floor
Defining defclass: WithWeights
Defining defclass: Habit
Defining defclass: InWork
Defining defclass: OutWork
Defining defclass: Movement
Defining defclass: TestPerson
Defining defclass: BasicPhysicalCondition
TRUE
CLIPS> (load instances.clp)
Defining definstances: Persons
Defining definstances: BasicPhysicalCondition
Defining definstances: TestPerson
Defining definstances: Exercises
Defining definstances: Habits
TRUE
CLIPS> (load facts_templates.CLP)
Defining deftemplate: personalData
Defining deffacts: persDat
Defining deftemplate: habitsPerson
Defining deffacts: habs
Defining deftemplate: basicPhyCond
Defining deffacts: bpc
Defining deftemplate: difficultyIntensity
Defining deffacts: dif_intens
Defining deftemplate: basicPhysicalCond
Defining deffacts: basicPC
Defining deftemplate: testPerson
Defining deffacts: testPers
Defining deftemplate: exercisesPerson
Defining deffacts: exsPerson
TRUE
CLIPS> (load messages.clp)
Defining defmessage-handler: Person
   Handler print primary defined.
TRUE
CLIPS> (load functions.clp)
Defining defglobal: user
Defining defglobal: opc
Defining defglobal: musc
Defining deffunction: set-value
Defining deffunction: set-number
Defining deffunction: set-single-from-list
Defining deffunction: set-multi-from-list
Defining deffunction: set-unique-list
Defining deffunction: set-difficulty
Defining deffunction: set-pulsations
Defining deffunction: calculate-totalTime
Defining deffunction: enoughTime
Defining deffunction: show-program
Defining deffunction: get-ex-musc
Defining deffunction: get-ex-cal
Defining deffunction: generate-schedule
TRUE
CLIPS> (load rules_modules.clp)

[CSTRCPSR1] WARNING: Redefining defmodule: MAIN
Defining defrule: start +j+j
Defining defmodule: createPerson-module
Defining defrule: create-person +j+j
Defining defmodule: habits-module
Defining defrule: set-habits +j+j
Defining defmodule: existingPerson-module
Defining defrule: existing-person =j+j+j+j+j
Defining defmodule: difficulty_intensity-module
Defining defrule: difficulty-intensity +j
Defining defmodule: bpc-module
Defining defrule: set-bpc +j+j+j
Defining defmodule: test-module
Defining defrule: set-test +j+j+j
Defining defmodule: exercises-module
Defining defrule: set-exercises +j+j+j
TRUE
CLIPS> (reset)
CLIPS> (run)

+-------------------------------------------+
|                                           |
|         WELCOME TO OUR FITNESS GYM        |
|                                           |
+-------------------------------------------+
Select an option:
1. Create a new person
2. Select an existing person
3. Exit
2
Seleccionando existente
1. - Alex
2. - Anna
3. - Javi
4. - Juan
5. - Kevin
6. - Lucas
7. - Maite
8. - Marc
9. - Pepe
10. - Victor
1


------------------------Person Basic Information-------------------------

    Name: Alex
    LastName: 
    age: 18 years 
    goal: (maintenance)
    Initial difficulty or intensity supported 
    (calculated by habits): hard

------------------------------Person Habits------------------------------

    OutWork: up_stairs 5 min with frequency: 'quite'
    Movement: walk 30 min with frequency: 'medium'

--------------------Person Basic Physical Information--------------------

    height: 180 cm 
    weight: 80 kg 
    index of body mass: 24.6913580246914
    blood maximum pressure: 120 sistolic 
    blood minimum pressure: 80 diastolic 
    diet: (balanced)
    muscular problems: (none)

-----------------------Results Test Basic Exercises----------------------

    exercises done: ([bike_easy] [run_easy])
    pulsations per minute: 93
        You are atheltic or you have bradycardia
    muscular tension: normal
    tiredness sensation: few
    dizziness: no

-------------------------------------------------------------------------


List of exercises filtered to assign to the schedule: 
	Triceps Hard Level 2
	Triceps Hard Level 1 (without Contraindications)
	Stretching Hard Level 2
	Stretching Hard Level 1 (without Contraindications)
	Dominates Hard Level 2
	Dominates Hard Level 1 (without Contraindications)
	Abdominals Hard Level 2
	Abdominals Hard Level 1 (without Contraindications)
	Run Hard Level 2
	Run Hard Level 1 (no Contraindications)
	Bike Hard Level 2
	Bike Hard Level 1 (without Contraindications)

How many minutes per day can you dedicate (in minutes) (between 30 and 960)?
200

-------------------monday-------------------
	EXERCISE: Bike Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Bike Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Dominates Hard Level 2

-------------------tuesday-------------------
	EXERCISE: Stretching Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Stretching Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Stretching Hard Level 2
	EXERCISE: Run Hard Level 1 (no Contraindications)
	EXERCISE: Dominates Hard Level 2

-------------------wednesday-------------------
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 2
	EXERCISE: Run Hard Level 2
	EXERCISE: Run Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Triceps Hard Level 1 (without Contraindications)

-------------------thursday-------------------
	EXERCISE: Run Hard Level 1 (no Contraindications)
	EXERCISE: Dominates Hard Level 2
	EXERCISE: Bike Hard Level 1 (without Contraindications)
	EXERCISE: Abdominals Hard Level 1 (without Contraindications)
	EXERCISE: Abdominals Hard Level 1 (without Contraindications)
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Bike Hard Level 1 (without Contraindications)
	EXERCISE: Stretching Hard Level 1 (without Contraindications)

-------------------friday-------------------
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
	EXERCISE: Abdominals Hard Level 2
	EXERCISE: Bike Hard Level 2
	EXERCISE: Dominates Hard Level 2
	EXERCISE: Run Hard Level 2
	EXERCISE: Run Hard Level 2
	EXERCISE: Triceps Hard Level 1 (without Contraindications)
CLIPS> 
